In [3]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

In [4]:
person

{'first': 'Corey', 'last': 'Schafer', 'email': 'CoreyMSchafer@gmail.com'}

In [5]:
people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}

In [6]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [8]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [9]:
import pandas as pd

In [77]:
df = pd.DataFrame(people)

In [78]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [12]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [13]:
type(df['email'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.ndim

2

In [16]:
df['email'].ndim

1

In [17]:
df['email'][1]

'JaneDoe@email.com'

In [18]:
df[['last','email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [19]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [20]:
df[:]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [21]:
df[:][:]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [28]:
df[:][0:1]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [29]:
df2 = pd.read_excel('calisanlar.xlsx')

In [30]:
df2

   Unnamed: 0    Ad Soyad           e-mail
0           0   Ali   Can       acan@b.com
1           1  Ayse  Sert    asert@bil.com
2           2  Velí  Ters  velters@bil.com
3           3   Nur   Can     nurcan@b.com

In [37]:
#odev sheet2'yi okuyun, yazma da olur
# sozluk yapip excel e yazip, excel de satir/sutun ekleyip okuyup, csv olarak yazma

In [32]:
df1 = pd.read_excel('calisanlar.xlsx', sheet_name = "Blad1")
df1

      yAd   ySoyad         kitap     konu   yil
0   Orhan    Pamuk     Sessiz Ev    Roman  2004
1   Jack    London     Beyaz Dis    Roman  1976
2  George    Orwel          1984  Siyaset  1948
3      JJ  Toolken  Harry Potter   Macera  2009

In [33]:
df.to_csv('my_data.csv', index=False)

In [36]:
df3=pd.read_csv('my_data2.csv')
df3

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Bora       Al          bora@spikeup.nl

In [38]:
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [39]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [40]:
df.iloc[0:2]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [42]:
df.iloc[0:3:2]  # start:stop:step

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com

In [43]:
df.iloc[0, 2]

'CoreyMSchafer@gmail.com'

In [44]:
df.iloc[0, 2] = 'Schafer@gmail.com'
df

   first     last              email
0  Corey  Schafer  Schafer@gmail.com
1   Jane      Doe  JaneDoe@email.com
2   John      Doe  JohnDoe@email.com

In [45]:
df.iloc[[0, 1], 2]

0    Schafer@gmail.com
1    JaneDoe@email.com
Name: email, dtype: object

In [49]:
df3.loc[3]

first               Bora
last                  Al
email    bora@spikeup.nl
Name: 3, dtype: object

In [51]:
df3.loc[:,'first']

0    Corey
1     Jane
2     John
3     Bora
Name: first, dtype: object

In [52]:
df.loc[ 0, 'email' ]

'Schafer@gmail.com'

In [55]:
df3.loc[ 3, ['email','last'] ]

email    bora@spikeup.nl
last                  Al
Name: 3, dtype: object

In [60]:
# df3.loc['Schafer@gmail.com','last'] olmadi --

In [61]:
import numpy as np

In [62]:
nd = [10,22,33,44,55,66,67]
nd

[10, 22, 33, 44, 55, 66, 67]

In [63]:
df4 = pd.DataFrame(nd)

In [64]:
df4

    0
0  10
1  22
2  33
3  44
4  55
5  66
6  67

In [66]:
arr = np.array(nd)
arr

array([10, 22, 33, 44, 55, 66, 67])

In [67]:
df5 = pd.DataFrame(arr)
df5

    0
0  10
1  22
2  33
3  44
4  55
5  66
6  67

In [68]:
df3

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Bora       Al          bora@spikeup.nl

In [69]:
yas = [34,56,43,22]
yas

[34, 56, 43, 22]

In [70]:
df3['age'] = pd.Series(yas)
df3

   first     last                    email  age
0  Corey  Schafer  CoreyMSchafer@gmail.com   34
1   Jane      Doe        JaneDoe@email.com   56
2   John      Doe        JohnDoe@email.com   43
3   Bora       Al          bora@spikeup.nl   22

In [71]:
df3['Country'] = pd.Series(['US','GB','NL','BE'])
df3

   first     last                    email  age Country
0  Corey  Schafer  CoreyMSchafer@gmail.com   34      US
1   Jane      Doe        JaneDoe@email.com   56      GB
2   John      Doe        JohnDoe@email.com   43      NL
3   Bora       Al          bora@spikeup.nl   22      BE

In [72]:
df3['Sehir'] = ['Petersburg','Moskova','Paris','Istanbul']
df3

   first     last                    email  age Country       Sehir
0  Corey  Schafer  CoreyMSchafer@gmail.com   34      US  Petersburg
1   Jane      Doe        JaneDoe@email.com   56      GB     Moskova
2   John      Doe        JohnDoe@email.com   43      NL       Paris
3   Bora       Al          bora@spikeup.nl   22      BE    Istanbul

In [73]:
df6 = df3.iloc[:,[5,1,0,2,3,4]]
df6

        Sehir     last  first                    email  age Country
0  Petersburg  Schafer  Corey  CoreyMSchafer@gmail.com   34      US
1     Moskova      Doe   Jane        JaneDoe@email.com   56      GB
2       Paris      Doe   John        JohnDoe@email.com   43      NL
3    Istanbul       Al   Bora          bora@spikeup.nl   22      BE

In [74]:
df6['Full Name'] = df6['first'] + ' ' +  df6['last']
df6

C:\Users\User\AppData\Local\Temp\ipykernel_11864\2390120844.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['Full Name'] = df6['first'] + ' ' +  df6['last']

,Sehir,last,first,email,age,Country,Full Name
0,Petersburg,Schafer,Corey,CoreyMSchafer@gmail.com,34,US,Corey Schafer
1,Moskova,Doe,Jane,JaneDoe@email.com,56,GB,Jane Doe
2,Paris,Doe,John,JohnDoe@email.com,43,NL,John Doe
3,Istanbul,Al,Bora,bora@spikeup.nl,22,BE,Bora Al

## Data Frame Silme

In [82]:
print(df6.drop(columns=['last','first']))
df6

        Sehir                    email  age Country      Full Name
0  Petersburg  CoreyMSchafer@gmail.com   34      US  Corey Schafer
1     Moskova        JaneDoe@email.com   56      GB       Jane Doe
2       Paris        JohnDoe@email.com   43      NL       John Doe
3    Istanbul          bora@spikeup.nl   22      BE        Bora Al

,Sehir,last,first,email,age,Country,Full Name
0,Petersburg,Schafer,Corey,CoreyMSchafer@gmail.com,34,US,Corey Schafer
1,Moskova,Doe,Jane,JaneDoe@email.com,56,GB,Jane Doe
2,Paris,Doe,John,JohnDoe@email.com,43,NL,John Doe
3,Istanbul,Al,Bora,bora@spikeup.nl,22,BE,Bora Al

In [83]:
df6.drop(columns=['last','first'], inplace=True)
df6

C:\Users\User\AppData\Local\Temp\ipykernel_11864\2884125224.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6.drop(columns=['last','first'], inplace=True)

        Sehir                    email  age Country      Full Name
0  Petersburg  CoreyMSchafer@gmail.com   34      US  Corey Schafer
1     Moskova        JaneDoe@email.com   56      GB       Jane Doe
2       Paris        JohnDoe@email.com   43      NL       John Doe
3    Istanbul          bora@spikeup.nl   22      BE        Bora Al

In [87]:
df6['Full Name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
3          [Bora, Al]
Name: Full Name, dtype: object

In [88]:
df6

        Sehir                    email  age Country      Full Name
0  Petersburg  CoreyMSchafer@gmail.com   34      US  Corey Schafer
1     Moskova        JaneDoe@email.com   56      GB       Jane Doe
2       Paris        JohnDoe@email.com   43      NL       John Doe
3    Istanbul          bora@spikeup.nl   22      BE        Bora Al

In [89]:
df6['Full Name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3   Bora       Al

In [90]:
df6

        Sehir                    email  age Country      Full Name
0  Petersburg  CoreyMSchafer@gmail.com   34      US  Corey Schafer
1     Moskova        JaneDoe@email.com   56      GB       Jane Doe
2       Paris        JohnDoe@email.com   43      NL       John Doe
3    Istanbul          bora@spikeup.nl   22      BE        Bora Al

In [91]:
df6[['First','Last']] = df6['Full Name'].str.split(' ', expand=True)
df6

,Sehir,email,age,Country,Full Name,First,Last
0,Petersburg,CoreyMSchafer@gmail.com,34,US,Corey Schafer,Corey,Schafer
1,Moskova,JaneDoe@email.com,56,GB,Jane Doe,Jane,Doe
2,Paris,JohnDoe@email.com,43,NL,John Doe,John,Doe
3,Istanbul,bora@spikeup.nl,22,BE,Bora Al,Bora,Al

In [92]:
df7 = df6.loc[:,['First','Last','age','email','Country','Sehir']]
df7

   First     Last  age                    email Country       Sehir
0  Corey  Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane      Doe   56        JaneDoe@email.com      GB     Moskova
2   John      Doe   43        JohnDoe@email.com      NL       Paris
3   Bora       Al   22          bora@spikeup.nl      BE    Istanbul

In [93]:
# field rename

## Satir Ekleme

In [94]:
s2 = {'First' : ['Ali','Ayse'],
     'Last' : ['Al','Ay'],
      'age' : [34,26]
     }
s2

{'First': ['Ali', 'Ayse'], 'Last': ['Al', 'Ay'], 'age': [34, 26]}

In [95]:
dfs = pd.DataFrame(s2)
dfs

  First Last  age
0   Ali   Al   34
1  Ayse   Ay   26

In [97]:
df7.append(dfs, ignore_index=True)
df7

C:\Users\User\AppData\Local\Temp\ipykernel_11864\2028107330.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df7.append(dfs, ignore_index=True)

   First     Last  age                    email Country       Sehir
0  Corey  Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane      Doe   56        JaneDoe@email.com      GB     Moskova
2   John      Doe   43        JohnDoe@email.com      NL       Paris
3   Bora       Al   22          bora@spikeup.nl      BE    Istanbul

In [98]:
result = pd.concat([df7, dfs])
result

   First     Last  age                    email Country       Sehir
0  Corey  Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane      Doe   56        JaneDoe@email.com      GB     Moskova
2   John      Doe   43        JohnDoe@email.com      NL       Paris
3   Bora       Al   22          bora@spikeup.nl      BE    Istanbul
0    Ali       Al   34                      NaN     NaN         NaN
1   Ayse       Ay   26                      NaN     NaN         NaN

In [104]:
merged_df = pd.merge(df7, dfs, how='outer')
merged_df

   First     Last  age                    email Country       Sehir
0  Corey  Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane      Doe   56        JaneDoe@email.com      GB     Moskova
2   John      Doe   43        JohnDoe@email.com      NL       Paris
3   Bora       Al   22          bora@spikeup.nl      BE    Istanbul
4    Ali       Al   34                      NaN     NaN         NaN
5   Ayse       Ay   26                      NaN     NaN         NaN

In [106]:
merged_df.loc[len(merged_df)] = ['Alexa','De Souza',40,'alex@br.nl','BR','Sao Paolu']
merged_df

   First      Last  age                    email Country       Sehir
0  Corey   Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane       Doe   56        JaneDoe@email.com      GB     Moskova
2   John       Doe   43        JohnDoe@email.com      NL       Paris
3   Bora        Al   22          bora@spikeup.nl      BE    Istanbul
4    Ali        Al   34                      NaN     NaN         NaN
5   Ayse        Ay   26                      NaN     NaN         NaN
6   Alex  De Souza   44               alex@br.nl      BR   Sao Paolu
7  Alexa  De Souza   40               alex@br.nl      BR   Sao Paolu

In [107]:
len(merged_df)

8

In [112]:
merged_df.drop(7, inplace=True)
merged_df

   First      Last  age                    email Country       Sehir
0  Corey   Schafer   34  CoreyMSchafer@gmail.com      US  Petersburg
1   Jane       Doe   56        JaneDoe@email.com      GB     Moskova
2   John       Doe   43        JohnDoe@email.com      NL       Paris
3   Bora        Al   22          bora@spikeup.nl      BE    Istanbul
4    Ali        Al   34                      NaN     NaN         NaN
5   Ayse        Ay   26                      NaN     NaN         NaN
6   Alex  De Souza   44               alex@br.nl      BR   Sao Paolu